Repository: arukas/ClashTray
Catalog: src/ClashTray.App/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# CoreStateText.Text
source: Stopped
zh_cn: 已停止

# ControllerStateConnected
source: Connected
zh_cn: 已连接

# ControllerStateConnecting
source: Connecting
zh_cn: 连接中

# ControllerStateReconnecting
source: Reconnecting
zh_cn: 正在重连

# ControllerStateAuthenticationFailed
source: Authentication failed
zh_cn: 认证失败

# ControllerStateCertificateFailed
source: Certificate validation failed
zh_cn: 证书验证失败

# ControllerStateIncompatible
source: Endpoint incompatible
zh_cn: 端点不兼容

# ControllerStateFailed
source: Connection failed
zh_cn: 连接失败

# ControllerStateDisconnected
source: Disconnected
zh_cn: 未连接

# ControllerLastConfirmedFormat
source: Last confirmed: {0}
zh_cn: 上次确认：{0}

# ControllerNoConfirmedData
source: No confirmed data yet
zh_cn: 尚无已确认数据

# ControllerEndpointButton.Content
source: Core not running
zh_cn: 核心未运行

# ControllerEndpointButton.AutomationProperties.Name
source: Open the local controller
zh_cn: 打开本机控制器

# ThemeButton.ToolTipService.ToolTip
source: Change theme
zh_cn: 切换主题

# ThemeButton.AutomationProperties.Name
source: Change theme
zh_cn: 切换主题

# ThemeFlyoutTitle.Text
source: Theme
zh_cn: 界面主题

# SystemThemeOption.Content
source: Auto (follow system)
zh_cn: 自动（跟随系统）

# LightThemeOption.Content
source: Light
zh_cn: 浅色

# DarkThemeOption.Content
source: Dark
zh_cn: 深色

# PinButton.ToolTipService.ToolTip
source: Pin window
zh_cn: 固定窗口

# PinButton.AutomationProperties.Name
source: Pin window
zh_cn: 固定窗口

# ReloadConfigurationButton.ToolTipService.ToolTip
source: Reload configuration
zh_cn: 重新加载配置

# ReloadConfigurationButton.AutomationProperties.Name
source: Reload configuration
zh_cn: 重新加载配置

# CoreActionButton.ToolTipService.ToolTip
source: Start core
zh_cn: 启动核心

# CoreActionButton.AutomationProperties.Name
source: Start or restart the core
zh_cn: 启动或重启核心

# RuleModeText.Text
source: Rule
zh_cn: 规则

# GlobalModeText.Text
source: Global
zh_cn: 全局

# DirectModeText.Text
source: Direct
zh_cn: 直连

# ProxyPageButton.Content
source: Proxy
zh_cn: 节点

# RulesPageButton.Content
source: Rules
zh_cn: 规则

# ConnectionsPageButton.Content
source: Connections
zh_cn: 连接

# LogsPageButton.Content
source: Logs
zh_cn: 日志

# SettingsPageButton.Content
source: Settings
zh_cn: 设置

# ConnectionsUnitText.Text
source: connections
zh_cn: 连接

# TrafficGraph.AutomationProperties.Name
source: Upload and download speed over the last minute
zh_cn: 最近一分钟上传和下载速度

# TotalTrafficText.Text
source: Total ↑ 0 KB ↓ 0 KB
zh_cn: 累计 ↑ 0 KB ↓ 0 KB

# ConfigButton.AutomationProperties.Name
source: Switch and manage configurations
zh_cn: 切换和管理配置

# ConfigManagementTitle.Text
source: Configurations
zh_cn: 配置管理

# ConfigurationsComboBox.PlaceholderText
source: Select a configuration
zh_cn: 选择配置

# ImportLocalButton.Content
source: Import YAML
zh_cn: 导入 YAML

# ImportSubscriptionButton.Content
source: Add subscription
zh_cn: 添加订阅

# ReloadConfigButton.Content
source: Reload
zh_cn: 重新加载

# DeleteConfigButton.Content
source: Delete
zh_cn: 删除配置

# ConfigRowLabel.Text
source: Configuration
zh_cn: 配置

# ConfigurationText.Text
source: Import a configuration
zh_cn: 导入配置

# SystemProxyLabel.Text
source: System proxy
zh_cn: 系统代理

# SystemProxyStateText.Text
source: Off
zh_cn: 已关闭

# SystemProxySwitch.AutomationProperties.Name
source: System proxy
zh_cn: 系统代理

# TunLabel.Text
source: TUN mode
zh_cn: TUN 模式

# TunStateText.Text
source: Off
zh_cn: 已关闭

# TunSwitch.AutomationProperties.Name
source: TUN mode
zh_cn: TUN 模式

# ProxyPortsLabel.Text
source: Proxy ports
zh_cn: 代理端口

# HttpEndpointButton.ToolTipService.ToolTip
source: Copy the HTTP proxy address
zh_cn: 复制 HTTP 代理地址

# MixedEndpointButton.ToolTipService.ToolTip
source: Copy the Mixed proxy address
zh_cn: 复制 Mixed 代理地址

# QuitButton.Content
source: Quit
zh_cn: 退出

# ProxyGroupsTitle.Text
source: Proxy groups
zh_cn: 代理组

# NodeCountText.Text
source: 0 groups
zh_cn: 0 组

# NodeSearchBox.PlaceholderText
source: Search groups or nodes
zh_cn: 搜索组或节点

# NodeSearchBox.AutomationProperties.Name
source: Search proxy groups or nodes
zh_cn: 搜索代理组或节点

# ProviderTitle.Text
source: Proxy providers
zh_cn: 代理提供者

# NoResultsText.Text
source: No matching nodes. Try different keywords.
zh_cn: 没有匹配的节点，试试其他关键词。

# EmptyTitle.Text
source: No proxy groups yet
zh_cn: 还没有代理组

# EmptyHint.Text
source: Import a YAML file or subscription from “Configurations” above. Start the core to see proxy groups and nodes here.
zh_cn: 点击上方“配置”导入 YAML 或订阅， 启动核心后，代理组与节点会显示在这里。

# RulesTitle.Text
source: Rules
zh_cn: 规则

# RulesSubtitle.Text
source: See which Mihomo rules the current connections match
zh_cn: 查看当前连接匹配到的 Mihomo 规则

# RulesSearchBox.PlaceholderText
source: Search rules, domains or policies
zh_cn: 搜索规则、域名或策略

# RulesFilterAllItem.Content
source: All
zh_cn: 全部

# RulesFilterDomainItem.Content
source: Domain
zh_cn: 域名

# RefreshRulesButton.Content
source: Refresh
zh_cn: 刷新

# RulesListView.AutomationProperties.Name
source: Rule list
zh_cn: 规则列表

# RulesEmptyListText.Text
source: No rules to show
zh_cn: 没有可显示的规则

# ConnectionsTitle.Text
source: Connections
zh_cn: 连接

# ConnectionsSubtitle.Text
source: View and manage active connections
zh_cn: 查看并管理当前活动连接

# CloseAllButton.Content
source: Close all
zh_cn: 关闭全部

# ConnectionsSearchBox.PlaceholderText
source: Search addresses, rules or policies
zh_cn: 搜索地址、规则或策略

# SortNewestItem.Content
source: Newest
zh_cn: 最新

# SortUploadItem.Content
source: Upload
zh_cn: 上传

# SortDownloadItem.Content
source: Download
zh_cn: 下载

# ConnectionsEmptyListText.Text
source: No matching connections
zh_cn: 当前没有匹配的连接

# ConnectionDetailsTitle.Text
source: Connection details
zh_cn: 连接详情

# CloseSelectedButton.Content
source: Close selected
zh_cn: 关闭选中

# ConnectionDetailsText.Text
source: Select a connection to see details
zh_cn: 选择连接查看详情

# LogsTitle.Text
source: Logs
zh_cn: 日志

# LogsSubtitle.Text
source: Live ClashTray and Mihomo logs
zh_cn: 实时查看 ClashTray 与 Mihomo 运行记录

# CopyLogsButton.Content
source: Copy
zh_cn: 复制

# ClearLogsButton.Content
source: Clear
zh_cn: 清空

# LogsSearchBox.PlaceholderText
source: Search log messages
zh_cn: 搜索日志内容

# LevelAllItem.Content
source: All
zh_cn: 全部

# LogLevelInfoItem.Content
source: Info
zh_cn: 信息

# LogLevelWarningItem.Content
source: Warning
zh_cn: 警告

# LogLevelErrorItem.Content
source: Error
zh_cn: 错误

# LogLevelDebugItem.Content
source: Debug
zh_cn: 调试

# SourceAllItem.Content
source: All sources
zh_cn: 全部来源

# LogsListView.AutomationProperties.Name
source: Log list
zh_cn: 日志列表

# LogsEmptyListText.Text
source: No matching log entries
zh_cn: 暂无匹配的日志

# SettingsTitle.Text
source: Settings
zh_cn: 设置

# SettingsSubtitle.Text
source: Adjust startup, proxy ports and Mihomo runtime options
zh_cn: 调整启动、代理端口和 Mihomo 运行参数

# SettingsSaveHint.Text
source: Select “Save settings” below to apply your changes.
zh_cn: 修改后请点击下方“保存设置”生效。

# RunModeHeader.Text
source: Behavior
zh_cn: 运行方式

# StartWithWindowsSwitch.Header
source: Start with Windows
zh_cn: 随 Windows 启动

# StartCoreSwitch.Header
source: Start the core automatically
zh_cn: 启动后自动启动核心

# AllowLanSwitch.Header
source: Allow LAN connections
zh_cn: 允许局域网连接

# Ipv6Switch.Header
source: Enable IPv6
zh_cn: 启用 IPv6

# TcpConcurrentSwitch.Header
source: Enable TCP concurrency
zh_cn: 启用 TCP 并发

# DisconnectAfterProxySwitch.Header
source: Close existing connections after switching nodes
zh_cn: 切换节点后断开现有连接

# DisconnectAfterProxySwitchHint.Text
source: When enabled, a successful node switch closes existing connections so new connections use the selected node immediately.
zh_cn: 开启后，节点切换成功会中断现有连接，让新连接立即使用所选节点。

# RestartOnChangeHint.Text
source: Changing ports, the controller port, TCP concurrency or the log level restarts the core in a controlled way while it is running; changing the Mixed port restores and then reapplies the system proxy.
zh_cn: 核心运行时修改端口、控制器端口、TUN 协议栈、TCP 并发或日志级别会自动受控重启；修改 Mixed 端口会先恢复再重新应用系统代理。

# ProgramOverridesHint.Text
source: System proxy, TUN, allow-LAN and IPv6 options in this panel are saved and controlled by ClashTray; matching options in configuration files do not override these choices.
zh_cn: 此处的 TUN 协议栈、允许局域网连接和 IPv6 设置由 ClashTray 保存并优先控制；“跟随配置文件”不会覆盖配置文件中的 stack。

# SaveSettingsButton.Content
source: Save settings
zh_cn: 保存设置

# NetworkSwitchHeader.Text
source: Network-based configuration switching
zh_cn: 按网络自动切换配置

# NetworkSwitchRulesHeader.Text
source: SSID rules
zh_cn: SSID 规则

# NetworkSwitchRulesHint.Text
source: Match the exact Wi-Fi name. Disabled rules are retained but never selected; an unavailable target is kept visible and will be reported instead of being applied.
zh_cn: 匹配精确的 Wi-Fi 名称。关闭的规则会保留但不会参与选择；不可用的目标会保留并提示，不会被自动应用。

# NetworkSwitchRulesListView.AutomationProperties.Name
source: SSID network switching rules
zh_cn: SSID 网络切换规则

# AddNetworkRuleButton.Content
source: Add SSID rule
zh_cn: 添加 SSID 规则

# NetworkSwitchEnabledSwitch.Header
source: Switch configuration automatically when the network changes
zh_cn: 网络变化后自动切换配置

# NetworkSwitchDefaultConfigurationBox.Header
source: Default configuration
zh_cn: 默认配置

# NetworkSwitchHint.Text
source: SSID rules are edited separately. Automatic switching waits for a stable network and uses a temporary manual override after you choose a configuration.
zh_cn: SSID 规则将在单独的区域编辑。自动切换会等待网络稳定；手动选择配置后会暂时覆盖自动切换。

# SaveNetworkSwitchButton.Content
source: Save network switching
zh_cn: 保存网络切换

# ResumeNetworkSwitchButton.Content
source: Resume automatic switching
zh_cn: 恢复自动切换

# PortsHeader.Text
source: Ports and proxy
zh_cn: 端口与代理

# ControllerPortBox.Header
source: Controller
zh_cn: 控制器

# ControllerPortLabel
source: Controller
zh_cn: 控制器

# BypassListBox.Header
source: System proxy bypass list
zh_cn: 系统代理绕过列表

# BypassListBox.PlaceholderText
source: Separate with semicolons, e.g. localhost;127.*
zh_cn: 使用分号分隔，例如 localhost;127.*

# SubscriptionRefreshHeader.Text
source: Subscription refresh interval
zh_cn: 订阅刷新间隔

# SubscriptionRefreshHoursBox.Header
source: Hours
zh_cn: 小时

# LogLevelBox.Header
source: Log level
zh_cn: 日志级别

# ThemeBox.Header
source: Theme
zh_cn: 主题

# ThemeSystemItem.Content
source: Follow system
zh_cn: 跟随系统

# ThemeLightItem.Content
source: Light
zh_cn: 浅色

# ThemeDarkItem.Content
source: Dark
zh_cn: 深色

# LanguageBox.Header
source: Language
zh_cn: 语言

# LanguageSystemItem.Content
source: Follow system
zh_cn: 跟随系统

# ClearDnsButton.Content
source: Clear DNS
zh_cn: 清理 DNS

# ClearFakeIpButton.Content
source: Clear FakeIP
zh_cn: 清理 FakeIP

# UpdateGeoButton.Content
source: Update Geo
zh_cn: 更新 Geo

# ProvidersHeader.Text
source: Providers
zh_cn: Provider

# ProvidersListView.AutomationProperties.Name
source: Provider status list
zh_cn: Provider 状态列表

# RefreshProviderButton.Content
source: Refresh selected provider
zh_cn: 刷新选中的 Provider

# CoreUpdateExpander.Header
source: Core update
zh_cn: 核心更新

# CoreVersionBox.Header
source: Version
zh_cn: 版本

# CoreVersionBox.PlaceholderText
source: For example v1.19.30
zh_cn: 例如 v1.19.31

# CoreDownloadUriBox.Header
source: Official GitHub download URL
zh_cn: 官方 GitHub 下载地址

# CoreSha256Box.PlaceholderText
source: 64-digit hexadecimal checksum
zh_cn: 64 位十六进制校验值

# InstallCoreButton.Content
source: Verify and install core
zh_cn: 校验并安装核心

# NetworkSwitchNoDefault
source: No default configuration
zh_cn: 不设置默认配置

# NetworkSwitchSsidHeader
source: Wi-Fi name
zh_cn: Wi-Fi 名称

# NetworkSwitchSsidPlaceholder
source: Exact SSID
zh_cn: 精确 SSID

# NetworkSwitchTargetHeader
source: Target configuration
zh_cn: 目标配置

# NetworkSwitchRuleEnabled
source: Rule enabled
zh_cn: 启用规则

# NetworkSwitchRemoveRule
source: Remove
zh_cn: 删除

# NetworkSwitchNoTarget
source: Select a configuration
zh_cn: 选择一个配置

# NetworkSwitchRuleLimit
source: Up to 128 network rules are supported.
zh_cn: 最多支持 128 条网络规则。

# NetworkSwitchSsidRequired
source: Enter an SSID for every network rule.
zh_cn: 请为每条网络规则填写 SSID。

# NetworkSwitchTargetRequired
source: Select a target configuration for every network rule.
zh_cn: 请为每条网络规则选择目标配置。

# NetworkSwitchDuplicateSsid
source: Enabled SSID rules must be unique.
zh_cn: 启用的 SSID 规则不能重复。

# NetworkSwitchMissingConfigurationFormat
source: Unavailable: {0}
zh_cn: 不可用：{0}

# NetworkSwitchUnavailable
source: Network context is not available
zh_cn: 网络上下文不可用

# NetworkSwitchStateDisabled
source: Automatic switching is paused
zh_cn: 自动切换已暂停

# NetworkSwitchStateWaiting
source: Waiting for a stable network
zh_cn: 等待网络稳定

# NetworkSwitchStatePermission
source: Windows permission is required to read the network
zh_cn: 需要 Windows 权限才能读取网络

# OpenNetworkPermissionButton.Content
source: Open Windows network permissions
zh_cn: 打开 Windows 网络权限

# NetworkPermissionSettingsOpened
source: Windows network permissions are open. Enable location access, then return to ClashTray.
zh_cn: 已打开 Windows 网络权限设置。请允许位置访问，然后返回 ClashTray。

# NetworkPermissionSettingsUnavailable
source: Windows network permission settings could not be opened.
zh_cn: 无法打开 Windows 网络权限设置。

# NetworkSwitchStateAmbiguous
source: Multiple active networks need attention
zh_cn: 有多个活动网络，需要进一步处理

# NetworkSwitchStateEvaluating
source: Evaluating network rules
zh_cn: 正在评估网络规则

# NetworkSwitchStateSwitching
source: Switching configuration
zh_cn: 正在切换配置

# NetworkSwitchStateManual
source: Manual configuration override is active
zh_cn: 手动配置覆盖已生效

# NetworkSwitchStateCooling
source: Cooling down after an automatic switch
zh_cn: 自动切换后正在冷却

# NetworkSwitchStateFailed
source: Automatic switching failed
zh_cn: 自动切换失败

# NetworkSwitchNoNetwork
source: No SSID identified
zh_cn: 未识别到 SSID

# NetworkSwitchStatusFormat
source: {0} · Network: {1}
zh_cn: {0} · 网络：{1}

# NetworkSwitchEnableConfirmTitle
source: Enable automatic network switching?
zh_cn: 启用按网络自动切换？

# NetworkSwitchEnableConfirmContent
source: ClashTray may change the active Mihomo configuration after the network becomes stable. System proxy and TUN settings are not changed by this option.
zh_cn: 网络稳定后，ClashTray 可能会切换当前 Mihomo 配置。此选项不会修改系统代理或 TUN 设置。

# NetworkSwitchEnableConfirmPrimary
source: Enable
zh_cn: 启用

# NetworkSwitchSaved
source: Network switching settings saved.
zh_cn: 网络切换设置已保存。

# NetworkSwitchResumeRequested
source: Automatic switching will resume on the next network evaluation.
zh_cn: 下一次网络评估时会恢复自动切换。

# CoreStateRunning
source: Running
zh_cn: 运行中

# CoreStateStarting
source: Starting
zh_cn: 启动中

# CoreStateStopping
source: Stopping
zh_cn: 停止中

# CoreStateRestarting
source: Restarting
zh_cn: 重启中

# CoreStateFailed
source: Failed
zh_cn: 异常

# CoreStateMissing
source: Not installed
zh_cn: 未安装

# CoreStateStopped
source: Stopped
zh_cn: 已停止

# ToolTipStartCore
source: Start core
zh_cn: 启动核心

# ToolTipRestartCore
source: Restart core
zh_cn: 重启核心

# CoreVersionIdleFormat
source: ClashTray {0} · Mihomo not running
zh_cn: ClashTray {0} · Mihomo 未启动

# ControllerCoreNotRunning
source: Core not running
zh_cn: 核心未运行

# ControllerRemoteNotAvailable
source: Remote endpoint has no local controller
zh_cn: 远程端点不提供本机控制器

# ControllerRemoteFormat
source: Remote · {0}
zh_cn: 远程 · {0}

# RemoteCoreActionUnavailable
source: Remote endpoints cannot control the local core
zh_cn: 远程端点不能控制本机核心

# RemoteLocalNetworkActionUnavailable
source: Remote endpoints cannot control local network state
zh_cn: 远程端点不能控制本机网络状态

# RemoteControllerReadOnly
source: Remote controller data is stale; reconnect before changing it
zh_cn: 远程控制器数据已过期，重新连接后才能修改

# RemoteControllerCapabilityUnavailable
source: This remote controller does not advertise the required capability
zh_cn: 此远程控制器未声明所需能力

# ToolTipControllerNeedsCore
source: Open the local controller once the core is running
zh_cn: 核心运行后可打开本机控制器

# ToolTipControllerOpenDashboard
source: Open MetaCubeXD in the default browser
zh_cn: 在默认浏览器打开 MetaCubeXD

# ToolTipControllerMissingDashboard
source: MetaCubeXD assets are missing; select to copy the local controller address
zh_cn: MetaCubeXD 资源缺失；点击复制本机控制器地址

# AutomationOpenDashboard
source: Open MetaCubeXD
zh_cn: 打开 MetaCubeXD

# AutomationOpenOrCopyController
source: Open or copy the local controller address
zh_cn: 打开或复制本机控制器地址

# TrafficUnavailable
source: ↑ unavailable ↓ unavailable
zh_cn: ↑ 暂不可用 ↓ 暂不可用

# MemoryUnavailable
source: Unavailable
zh_cn: 暂不可用

# TotalTrafficFormat
source: Total ↑ {0} ↓ {1}
zh_cn: 累计 ↑ {0} ↓ {1}

source: Total traffic unavailable
zh_cn: 累计流量暂不可用

# SwitchStateOn
source: On
zh_cn: 已开启

# SwitchStateEnabling
source: Turning on
zh_cn: 开启中

# SwitchStateDisabling
source: Turning off
zh_cn: 关闭中

# SwitchStateRestoreRequired
source: Restore required
zh_cn: 需要恢复

# SwitchStateFailed
source: Failed
zh_cn: 操作失败

# SwitchStateOff
source: Off
zh_cn: 已关闭

# TunStateUnavailable
source: Service not installed
zh_cn: 服务未安装

# TunStateUnknown
source: Cannot confirm
zh_cn: 无法确认

# TunStateRecovering
source: Recovering
zh_cn: 正在恢复

# TunRecoveryMissingAddress
source: TUN startup failed. Mihomo recovered automatically and TUN is now off. Reason: no usable interface address was found.
zh_cn: TUN 启动失败，Mihomo 已自动恢复，当前 TUN 已关闭。 原因：缺少可用的接口地址。

# TunConfigurationMissingAddress
source: TUN cannot be turned on and remains off. Reason: the configuration does not contain a usable interface address.
zh_cn: TUN 无法开启，当前 TUN 保持关闭。 原因：配置没有可用的接口地址。

# TunRecoveryUnknown
source: TUN state cannot be confirmed. To avoid affecting your network, no further retry was attempted; check the service and diagnostic logs.
zh_cn: TUN 状态无法确认。为避免影响网络，未继续重试；请检查服务和诊断日志。

# OperationBusy
source: An operation is already in progress. Try again later.
zh_cn: 操作正在进行，请稍后重试。

# ConfigImportPrompt
source: Import a configuration
zh_cn: 导入配置

# ToolTipPinWindow
source: Pin window
zh_cn: 固定窗口

# ToolTipUnpinWindow
source: Unpin
zh_cn: 取消固定

# DialogAddSubscriptionTitle
source: Add subscription
zh_cn: 添加订阅

# DialogSubscriptionUrlLabel
source: Subscription URL
zh_cn: 订阅地址

# DialogOptionalNamePlaceholder
source: Optional name
zh_cn: 可选名称

# DialogAdd
source: Add
zh_cn: 添加

# DialogCancel
source: Cancel
zh_cn: 取消

# DialogDelete
source: Delete
zh_cn: 删除

# DialogDeleteConfigTitle
source: Delete configuration
zh_cn: 删除配置

# DialogDeleteConfigActiveFormat
source: Delete “{0}”? The active configuration is in use, so the running core will also stop.
zh_cn: 确定删除“{0}”吗？活动配置删除后，正在运行的核心也会停止。

# DialogDeleteConfigFormat
source: Delete “{0}”? This removes the local configuration file.
zh_cn: 确定删除“{0}”吗？此操作会删除本地配置文件。

# MessageDashboardMissingCopied
source: MetaCubeXD assets are missing; the local controller address was copied.
zh_cn: MetaCubeXD 资源缺失，已复制本机控制器地址。

# ErrorOpenDashboard
source: Could not open the local controller in the default browser.
zh_cn: 无法打开默认浏览器中的本机控制器入口。

# ProxyEmptyTitleRunning
source: No proxy groups in the configuration
zh_cn: 配置中没有代理组

# ProxyEmptyTitleStopped
source: No proxy groups yet
zh_cn: 还没有代理组

# GroupNotSelected
source: Not selected
zh_cn: 尚未选择

# ToolTipTestGroup
source: Test latency for the whole group
zh_cn: 测试整组节点延迟

# AutomationTestGroupFormat
source: Test latency for the whole {0} group
zh_cn: 测试 {0} 整组节点延迟

# TestingGroupFormat
source: {0} · Testing the group…
zh_cn: {0} · 正在测试整组节点…

# TestCompleteFormat
source: {0} · Test finished: {1} reachable, {2} unreachable
zh_cn: {0} · 测速完成，{1} 个可用，{2} 个未连通

# TestFailedFormat
source: {0} · Test failed: {1}
zh_cn: {0} · 测速失败：{1}

# AutomationNodeListFormat
source: {0} nodes
zh_cn: {0} 节点

# NodeCountFormat
source: {0} nodes
zh_cn: {0} 个节点

# NodeCountSearchFormat
source: {0} of {1} nodes
zh_cn: {0} / {1} 个节点

# CurrentLabel
source: Current
zh_cn: 当前

# CurrentNodeSuffix
source: , current node
zh_cn: ，当前节点

# ExpandVerb
source: Expand
zh_cn: 展开

# CollapseVerb
source: Collapse
zh_cn: 收起

# AutomationGroupHeaderFormat
source: {0} {1}, current {2}
zh_cn: {0} {1}，当前 {2}

# GroupCountFormat
source: {0} groups
zh_cn: {0} 组

# GroupCountSearchFormat
source: {0} of {1} groups
zh_cn: {0} / {1} 组

# ProviderSectionTitleFormat
source: Proxy providers · {0}
zh_cn: 代理提供者 · {0}

# ProviderItemFormat
source: {0} items · {1}
zh_cn: {0} 项 · {1}

# ToolTipRefreshProviderFormat
source: Refresh {0}
zh_cn: 刷新 {0}

# AutomationRefreshProviderFormat
source: Refresh proxy provider {0}
zh_cn: 刷新代理提供者 {0}

# DelayNotTested
source: Not tested
zh_cn: 未测速

# DelayTimeout
source: Timeout
zh_cn: 超时

# RulesRefreshed
source: Rules and provider status refreshed.
zh_cn: 规则和 Provider 状态已刷新。

# RefreshFailedFormat
source: Refresh failed: {0}
zh_cn: 刷新失败：{0}

# SelectConnectionHint
source: Select a connection to see details
zh_cn: 选择连接查看详情

# ConnectionDetailsFormat
source: {0} · {1} Rule: {2} {3} Upload {4} B · Download {5} B
zh_cn: {0} · {1} 规则：{2} {3} 上传 {4} B · 下载 {5} B

# CloseConnectionFailedFormat
source: Failed to close the connection: {0}
zh_cn: 关闭连接失败：{0}

# ErrorInvalidRefreshHours
source: The subscription refresh interval must be a whole number of hours between 1 and 168.
zh_cn: 订阅刷新间隔必须是 1 到 168 之间的整数小时。

# SettingsSaved
source: Settings saved. Core options that require it restart the core in a controlled way, and the system proxy picks up the new port once the core is healthy.
zh_cn: 设置已保存；需要重启的核心参数会自动受控重启，系统代理会在核心健康后使用新端口。

# SettingsSaveFailedFormat
source: Failed to save settings: {0}
zh_cn: 设置保存失败：{0}

# FakeIpCleared
source: FakeIP cache cleared.
zh_cn: FakeIP 缓存已清理。

# DnsCleared
source: DNS cache cleared.
zh_cn: DNS 缓存已清理。

# GeoUpdateSent
source: Geo database update requested.
zh_cn: Geo 数据库更新请求已发送。

# SelectProviderFirst
source: Select a provider first.
zh_cn: 先选择一个 Provider。

# ProviderRefreshRequestedFormat
source: Refresh requested for {0}.
zh_cn: 已请求刷新 {0}。

# ProviderStatusSummaryFormat
source: {0} · {1} items
zh_cn: {0} · {1} 项

# CoreUpdateFieldsRequired
source: Enter the official HTTPS download URL, the version and the 64-digit SHA-256.
zh_cn: 请填写官方 HTTPS 下载地址、版本和 64 位 SHA-256。

# CoreUpdateDone
source: The core was verified and atomically replaced.
zh_cn: 核心已完成校验并原子替换。

# ErrorPortRangeFormat
source: The {0} port must be a whole number between 1 and 65535.
zh_cn: {0} 端口必须是 1 到 65535 之间的整数。

# NetworkPermissionDenied
source: Windows does not currently allow reading network status.
zh_cn: Windows 当前不允许读取网络状态。

# NetworkApiUnavailable
source: The Windows network status API is currently unavailable.
zh_cn: Windows 网络状态 API 当前不可用。

# NetworkStateReadFailed
source: Could not read the Windows network status.
zh_cn: 无法读取 Windows 网络状态。

# StartupStatusReadFailedFormat
source: Could not read the Windows startup state: {0}
zh_cn: 无法读取 Windows 启动状态：{0}

# StartupRegisteredButDisabled
source: Startup is registered but Windows disabled it; enable it in Task Manager → Startup apps.
zh_cn: 开机启动已注册，但 Windows 已禁用；请在任务管理器的“启动应用”中启用。

# StartupNeedsRepair
source: Startup is on, but the registered command changed; select “Save settings” to repair it.
zh_cn: 开机启动已打开，但启动项命令已变化；点击“保存设置”修复。

# StartupRegistered
source: Startup is registered.
zh_cn: 开机启动已注册。

# StartupMissing
source: Startup is on, but the entry is missing; select “Save settings” to repair it.
zh_cn: 开机启动已打开，但启动项缺失；点击“保存设置”修复。

# StartupOffForeignItem
source: Startup is off; an entry with the same name exists, and saving keeps the other program's command.
zh_cn: 开机启动已关闭；检测到同名启动项，保存时会保留其他程序的命令。

# StartupOff
source: Startup is off.
zh_cn: 开机启动已关闭。

# ProviderItemKindRule
source: Rule
zh_cn: 规则

# ProviderItemKindProxy
source: Proxy
zh_cn: 代理

# ProviderListItemFormat
source: {0} · {1} · {2} items · {3}
zh_cn: {0} · {1} · {2} 项 · {3}

# LanguageRestartPrompt
source: The language change takes effect the next time ClashTray starts.
zh_cn: 语言将在下次启动 ClashTray 时生效。

# TrayTooltipConnecting
source: ClashTray · Connecting
zh_cn: ClashTray · 连接中

# TrayTooltipRunning
source: ClashTray · Running
zh_cn: ClashTray · 运行中

# TrayTooltipSystemProxy
source: ClashTray · System proxy on
zh_cn: ClashTray · 系统代理已开启

# TrayTooltipTun
source: ClashTray · TUN on
zh_cn: ClashTray · TUN 已开启

# TrayTooltipPaused
source: ClashTray · Paused
zh_cn: ClashTray · 已暂停
